base/Documents/бит_УстановкаЗначенийПроизвольныхПараметров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бит_УстановкаЗначенийПроизвольныхПараметров</Name>
			<BasedOn>
				<xr:Item>ChartOfCharacteristicTypes.бит_ВидыПроизвольныхПараметров</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.бит_ЗначенияПроизвольныхПараметров</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Comment>Ручная корректировка (служебный реквизит)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыПроизвольныхПараметров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.бит_СценарииПланирования</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
						<v8:Type>cfg:CatalogRef.УдалитьЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Пользователь, ответственный за заполнение данного документа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗначенияПараметра</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Аналитика_1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_4</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПараметра</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыПроизвольныхПараметров</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

base/Documents/бит_УстановкаЗначенийПроизвольныхПараметров/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаОбъектаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Ключ.Пустая() Тогда
		ПодготовитьФормуНаСервере();
	КонецЕсли;
	
	ОформитьАналитики();
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	УстановитьСостояниеДокумента();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПодготовитьФормуНаСервере();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если Источник = УникальныйИдентификатор Тогда
		
		Если ИмяСобытия = "ПолучениеДанныхБюджета" Тогда			
			ОбработкаЗаполненияИзИсточникаДанных(Параметр);			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаСервере
Процедура ПараметрПриИзмененииНаСервере()
	
	Объект.ЕдиницаИзмерения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Параметр, "ЕдиницаИзмерения");
	ОформитьАналитики();
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ПараметрПриИзменении(Элемент)
	
	Если ТекущийПараметр <> Объект.Параметр И Объект.ЗначенияПараметра.Количество() > 0 Тогда
		ТекстСообщения = НСтр("ru = 'При изменении параметра табличная часть будет очищена. Продолжить?'; 
							  |en = 'When the parameter is changed, the tabular part will be cleared. Continue?'");
		
		Ответ = Ждать ВопросАсинх(ТекстСообщения, РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			Объект.ЗначенияПараметра.Очистить();
			ПараметрПриИзмененииНаСервере();
		Иначе	
			Объект.Параметр = ТекущийПараметр;
		КонецЕсли;
	Иначе
		ПараметрПриИзмененииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗначенияПараметра

&НаКлиенте
Процедура ЗначенияПараметраАналитика_1НачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ЗначенияПараметра.ТекущиеДанные;
	ИмяПоля 	  = "Аналитика_1";

	бит_МеханизмДопИзмеренийКлиент.ВыбратьТипСоставнойАналитики(ЭтотОбъект, Элемент, ТекущиеДанные, ИмяПоля,
			СтандартнаяОбработка, НастройкиАналитик);
			
КонецПроцедуры

&НаКлиенте
Процедура ЗначенияПараметраАналитика_2НачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	ТекущиеДанные = Элементы.ЗначенияПараметра.ТекущиеДанные;
	ИмяПоля 	  = "Аналитика_2";

	бит_МеханизмДопИзмеренийКлиент.ВыбратьТипСоставнойАналитики(ЭтотОбъект, Элемент, ТекущиеДанные, ИмяПоля,
			СтандартнаяОбработка, НастройкиАналитик);

КонецПроцедуры

&НаКлиенте
Процедура ЗначенияПараметраАналитика_3НачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	ТекущиеДанные = Элементы.ЗначенияПараметра.ТекущиеДанные;
	ИмяПоля 	  = "Аналитика_3";

	бит_МеханизмДопИзмеренийКлиент.ВыбратьТипСоставнойАналитики(ЭтотОбъект, Элемент, ТекущиеДанные, ИмяПоля,
			СтандартнаяОбработка, НастройкиАналитик);

КонецПроцедуры

&НаКлиенте
Процедура ЗначенияПараметраАналитика_4НачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ЗначенияПараметра.ТекущиеДанные;
	ИмяПоля 	  = "Аналитика_4";

	бит_МеханизмДопИзмеренийКлиент.ВыбратьТипСоставнойАналитики(ЭтотОбъект, Элемент, ТекущиеДанные, ИмяПоля,
			СтандартнаяОбработка, НастройкиАналитик);

КонецПроцедуры
	
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Асинх Процедура ЗаполнитьПоИсточникуДанных(Команда)
	
	Если Модифицированность ИЛИ Объект.Ссылка.Пустая() Тогда
		ТекстВопроса = НСтр("ru='Перед выполнением действия документ необходимо записать. Записать документ?';
							|en='Before performing an operation document must be saved. Save the document?'");
		
		Ответ = Ждать ВопросАсинх(ТекстВопроса, РежимДиалогаВопрос.ДаНет);		
		Если Ответ = КодВозвратаДиалога.Да Тогда
			Записать();
			ВызватьФормуЗаполненияПоИсточнику();	
		КонецЕсли; 
	Иначе
		ВызватьФормуЗаполненияПоИсточнику(); 
	КонецЕсли;	
	
КонецПроцедуры

#Область СтандартныеПодсистемыОбработчикиКоманд

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(Знач ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ЗаполнениеЗначенийПоИсточникам

&НаКлиенте
Процедура ОбработкаЗаполненияИзИсточникаДанных(ВыбранноеЗначение)
	
	Если ВыбранноеЗначение.Режим = "Заполнить" 
		И Объект.ЗначенияПараметра.Количество() > 0 Тогда 
		
		// В режиме заполнения существующие данные следует очистить.
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("ВыбранноеЗначение", ВыбранноеЗначение);
		бит_РаботаСДиалогамиКлиент.ЗапросПодтвержденияОчисткиДанных(ЭтотОбъект, ДопПараметры);
	Иначе
		ЗаполнитьТабЧасть(ВыбранноеЗначение, Ложь);
	КонецЕсли; // Режим заполнения.
	
КонецПроцедуры

// Оповещение на вопрос о подтверждение очистки.
//
// Параметры:
//  Результат    - КодВозвратаДиалога.
//  ДопПараметры - Структура.
//
&НаКлиенте
Процедура ОтветНаПотверждениеОчистки(РезультатОтвет, ДопПараметры) Экспорт
	
	ОчищатьДанные = РезультатОтвет = КодВозвратаДиалога.Да;
    
    Если ОчищатьДанные Тогда
        ЗаполнитьТабЧасть(ДопПараметры.ВыбранноеЗначение, ОчищатьДанные);
    КонецЕсли;
    
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТабЧасть(Знач ВыбранноеЗначение, Знач ОчищатьДанные)
	
	Модифицированность = Истина;
	
	Если ОчищатьДанные Тогда
		Объект.ЗначенияПараметра.Очистить();
	КонецЕсли; 
	
	ДанныеЗаполнения = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресОборотовПоБюджетам);	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ТаблицаЗначений") Тогда
		
		КолонкиГруппировки  = "Аналитика_1, Аналитика_2, Аналитика_3, Аналитика_4";
		КолонкиСуммирования = "СуммаСценарийВВалютеДокумента";
		
		ТаблицаЗаполнения = ДанныеЗаполнения.Скопировать(, КолонкиГруппировки + ", " + КолонкиСуммирования);
		ТаблицаЗаполнения.Свернуть(КолонкиГруппировки, КолонкиСуммирования);
		ТаблицаЗаполнения.Колонки.СуммаСценарийВВалютеДокумента.Имя = "ЗначениеПараметра";
		
		Если ОчищатьДанные Тогда
			Объект.ЗначенияПараметра.Загрузить(ТаблицаЗаполнения);
		Иначе
			Для каждого СтрокаЗаполнения Из ТаблицаЗаполнения Цикл
				НоваяСтрокаЗначения = Объект.ЗначенияПараметра.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаЗначения, СтрокаЗаполнения);
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	ТекстСообщения = НСтр("ru='Заполнение завершено.';en='Filling in completed.'");
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ПодготовитьФормуНаСервере()

	УстановитьСостояниеДокумента();
	НастройкиАналитик = НовыеНастройкиАналитик();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСостояниеДокумента()
	
	СостояниеДокумента = бит_ОбщегоНазначения.СостояниеДокумента(Объект);
	
КонецПроцедуры

&НаСервере
Процедура ОформитьАналитики()
	
	ЭлементыКолонокАналитики = ЭлементыКолонокАналитики();
	
	ТекущийПараметр = Объект.Параметр;
	
	Если Объект.Параметр.Пустая() Тогда
		Для каждого ЭлементКолонкаАналитики Из ЭлементыКолонокАналитики Цикл
			ЭлементКолонкаАналитики.Видимость = Ложь;
		КонецЦикла;
		Возврат;
	КонецЕсли;
	
	АтрибутыПараметра = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Параметр, "ЕдиницаИзмерения, ТипЗначения, КоличествоАналитик");
	Элементы.ЗначенияПараметраЗначениеПараметра.ОграничениеТипа = АтрибутыПараметра.ТипЗначения;
	КоличествоАналитик = АтрибутыПараметра.КоличествоАналитик;
	
	ФорматРедактированияЗначения = "";
	Если АтрибутыПараметра.ТипЗначения.СодержитТип(Тип("Число")) Тогда
		КвЧисла                      = АтрибутыПараметра.ТипЗначения.КвалификаторыЧисла;
		ФорматРедактированияЗначения = СтрШаблон("ЧЦ=%1; ЧДЦ=%2", Строка(КвЧисла.Разрядность), Строка(КвЧисла.РазрядностьДробнойЧасти));
	КонецЕсли;	
	Элементы.ЗначенияПараметраЗначениеПараметра.Формат = ФорматРедактированияЗначения;
	
	ВсегоАналитикДокумента = ЭлементыКолонокАналитики.Количество();
	ВыборкаАналитик = Документы.бит_УстановкаЗначенийПроизвольныхПараметров.АтрибутыПроизвольногоПараметра(Объект.Параметр, ВсегоАналитикДокумента);

	Пока ВыборкаАналитик.Следующий() Цикл
		ЭлементКолонкаАналитики = ЭлементыКолонокАналитики.Получить(ВыборкаАналитик.НомерСтроки - 1);
		ЭлементКолонкаАналитики.Видимость       = Истина;
		ЭлементКолонкаАналитики.Заголовок       = ВыборкаАналитик.НаименованиеАналитики;
		ЭлементКолонкаАналитики.ОграничениеТипа = ВыборкаАналитик.ТипЗначенияАналитики;
		ЭлементКолонкаАналитики.ВыбиратьТип     = ВыборкаАналитик.ТипЗначенияАналитики.Типы().Количество() > 1;	
		
		НоваяЗапись = НастройкиАналитик["Аналитика_" + ВыборкаАналитик.НомерСтроки];
		НоваяЗапись.Аналитика 		= ВыборкаАналитик.Аналитика;
		НоваяЗапись.ЭтоСоставнойТип = ВыборкаАналитик.ТипЗначенияАналитики.Типы().Количество() > 1;
		НоваяЗапись.ТипЗначения 	= ВыборкаАналитик.ТипЗначенияАналитики;
	КонецЦикла;
	
	Если КоличествоАналитик < ВсегоАналитикДокумента Тогда
		Для Сч = (КоличествоАналитик + 1) По ВсегоАналитикДокумента Цикл
			ЭлементКолонкаАналитики = ЭлементыКолонокАналитики.Получить(Сч - 1);
			ЭлементКолонкаАналитики.Видимость = Ложь;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция НовыеНастройкиАналитик()

	НовыеНастройкиАналитик = Новый Структура; 
	
	ВГраница = ЭлементыКолонокАналитики().Количество();
	Для Счетчик = 1 По ВГраница Цикл
		НоваяЗапись = Новый Структура;
		НоваяЗапись.Вставить("Аналитика", 		Неопределено);
		НоваяЗапись.Вставить("ЭтоСоставнойТип", Ложь);
		НоваяЗапись.Вставить("ТипЗначения", 	Новый ОписаниеТипов);
		НовыеНастройкиАналитик.Вставить("Аналитика_" + Счетчик, НоваяЗапись);
	КонецЦикла;	

	Возврат НовыеНастройкиАналитик;
	
КонецФункции

&НаСервере
Функция ЭлементыКолонокАналитики()
	
	ЭлементыКолонокАналитики = Новый Массив;
	ЭлементыКолонокАналитики.Добавить(Элементы.ЗначенияПараметраАналитика_1);
	ЭлементыКолонокАналитики.Добавить(Элементы.ЗначенияПараметраАналитика_2);
	ЭлементыКолонокАналитики.Добавить(Элементы.ЗначенияПараметраАналитика_3);
	ЭлементыКолонокАналитики.Добавить(Элементы.ЗначенияПараметраАналитика_4);
	
	Возврат ЭлементыКолонокАналитики;
	
КонецФункции

&НаКлиенте
Процедура ВызватьФормуЗаполненияПоИсточнику()
	
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("ВалютаДокумента"              , Объект.ЕдиницаИзмерения);
	ПараметрыЗаполнения.Вставить("КурсДокумента"                , 1);
	ПараметрыЗаполнения.Вставить("КратностьДокумента"           , 1);
	ПараметрыЗаполнения.Вставить("Сценарий"                     , Объект.Сценарий);
	ПараметрыЗаполнения.Вставить("ЕдиницаИзмеренияСуммДокумента", Объект.ЕдиницаИзмерения);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ПараметрыЗаполнения", ПараметрыЗаполнения);
	ПараметрыФормы.Вставить("ДатаДок"            , Объект.Дата);
	ПараметрыФормы.Вставить("ДокументЗаполнения" , Объект.Ссылка);
	ПараметрыФормы.Вставить("РежимЗаполнения"    , "ПроизвольныеПараметры");
	
	ОткрытьФорму("Обработка.бит_ПолучениеДанныхБюджета.Форма", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)

	Объект	 = Форма.Объект;
	Элементы = Форма.Элементы;
	
	Элементы.ЗначенияПараметра.ТолькоПросмотр = НЕ ЗначениеЗаполнено(Объект.Параметр);
	
	Элементы.ЗначенияПараметраЗаполнитьПоИсточникуДанных.Доступность = ЗначениеЗаполнено(Объект.Параметр);
	
КонецПроцедуры

#КонецОбласти
